In [1]:
#TASKS DAY2
#ADDING A ROW TO ORIGINAL ARRAY
import numpy as np
ar=np.array([[1,2,3],[45,6,78],[89,90,6]])
n=np.array([12,23,45])
#print("original array",ar)
new=np.r_[ar,[n]]
print(new)

[[ 1  2  3]
 [45  6 78]
 [89 90  6]
 [12 23 45]]

In [2]:
#DAY 3
import pandas as pd
df=pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  0.953890  0.237826  0.696741  0.087344
B -0.751095 -0.982188 -0.560045  0.701380
C -0.291148 -1.045924 -0.093133 -2.515986
D  1.402716 -1.069290  0.722661  0.548650
E  0.123803  0.011254  0.288670 -1.588083

In [3]:
#to access a row
df.loc['A']

W    0.953890
X    0.237826
Y    0.696741
Z    0.087344
Name: A, dtype: float64

In [4]:
#to access multiple rows
df.loc[['A','C']]

          W         X         Y         Z
A  0.953890  0.237826  0.696741  0.087344
C -0.291148 -1.045924 -0.093133 -2.515986

In [5]:
#to access rows based on index position
df.iloc[3]

W    1.402716
X   -1.069290
Y    0.722661
Z    0.548650
Name: D, dtype: float64

In [6]:
#To get specific value of co-ordinate in a dataframe
df.loc['B','Y']#syntax-->df.loc[row,column]

-0.5600451861813578

In [7]:
#to get multiple co-ordinates
df.loc[['A','B'],['W','Z']]#df.loc[[rows],[columns]]

          W         Z
A  0.953890  0.087344
B -0.751095  0.701380

In [8]:
#retreiving data based on the condition
#to get all values greater than 0
print(df>0)#boolean
print(df[df>0])#to get values in numeric

       W      X      Y      Z
A   True   True   True   True
B  False  False  False   True
C  False  False  False  False
D   True  False   True   True
E   True   True   True  False
          W         X         Y         Z
A  0.953890  0.237826  0.696741  0.087344
B       NaN       NaN       NaN  0.701380
C       NaN       NaN       NaN       NaN
D  1.402716       NaN  0.722661  0.548650
E  0.123803  0.011254  0.288670       NaN

In [9]:
#to get specific column
df['W']>0

A     True
B    False
C    False
D     True
E     True
Name: W, dtype: bool

In [10]:
#to apply condition on column
df[df['W']>0]

          W         X         Y         Z
A  0.953890  0.237826  0.696741  0.087344
D  1.402716 -1.069290  0.722661  0.548650
E  0.123803  0.011254  0.288670 -1.588083

In [11]:
#to handle missing data
d={"A":[1,2,np.nan],"B":[5,np.nan,np.nan],"C":[1,2,3],"D":[np.nan,np.nan,np.nan]}
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3], 'D': [nan, nan, nan]}

In [12]:
df1=pd.DataFrame(d)
df1

     A    B  C   D
0  1.0  5.0  1 NaN
1  2.0  NaN  2 NaN
2  NaN  NaN  3 NaN

In [13]:
#to drop values with Nan
#dropna()
df1.dropna()

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [14]:
#dropna(how,thresh,axis,inplace)
#how="all" or "any"
print("\n",df1.dropna(how="all"))#it will check all nan values to delete that row
print("\n",df1.dropna(how="any"))#it will delete the rows which have single nan value

      A    B  C   D
0  1.0  5.0  1 NaN
1  2.0  NaN  2 NaN
2  NaN  NaN  3 NaN

 Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [15]:
df1.dropna(how="all",axis=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [16]:
df1.isna()#it returns true if it has nan value

       A      B      C     D
0  False  False  False  True
1  False   True  False  True
2   True   True  False  True

In [17]:
#to check the sum of nan values in each column
df1.isna().sum()

A    1
B    2
C    0
D    3
dtype: int64

In [18]:
#thresh
#it should have non-nan value more than or equal to thresh value
df1.dropna(thresh=2)

     A    B  C   D
0  1.0  5.0  1 NaN
1  2.0  NaN  2 NaN

In [19]:

df1.dropna(thresh=2,axis=1)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [20]:
#fillna
#it is used to fill values in place of nan values
df1.fillna(value=0)

     A    B  C    D
0  1.0  5.0  1  0.0
1  2.0  0.0  2  0.0
2  0.0  0.0  3  0.0

In [21]:
#printing of average of two values in nan value
df1['A'].fillna(value=df1['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [22]:
#Group by
#to group based on column and perform aggregate functions
data={'company':['Google','Google','Meta','Meta','Fb','Fb'],
     'person':['sam','mani','sai','prasanth','mohan','mounika'],
     'salaries':[300,500,100,200,600,20]}
df2=pd.DataFrame(data)
df2

  company    person  salaries
0  Google       sam       300
1  Google      mani       500
2    Meta       sai       100
3    Meta  prasanth       200
4      Fb     mohan       600
5      Fb   mounika        20

In [23]:
bycomp=df2.groupby('company')

bycomp

In [24]:
bycomp.sum(),['sales']

(               person  salaries
 company
 Fb       mohanmounika       620
 Google        sammani       800
 Meta      saiprasanth       300,
 ['sales'])

In [25]:
#frequency
bycomp.value_counts()

company  person    salaries
Fb       mohan     600         1
         mounika   20          1
Google   mani      500         1
         sam       300         1
Meta     prasanth  200         1
         sai       100         1
Name: count, dtype: int64

In [26]:
#to get maximum salary
df2.loc[bycomp['salaries'].idxmax()][['company','person','salaries']]

  company    person  salaries
4      Fb     mohan       600
1  Google      mani       500
3    Meta  prasanth       200

In [27]:
bycomp.describe()

        salaries
           count   mean         std    min    25%    50%    75%    max
company
Fb           2.0  310.0  410.121933   20.0  165.0  310.0  455.0  600.0
Google       2.0  400.0  141.421356  300.0  350.0  400.0  450.0  500.0
Meta         2.0  150.0   70.710678  100.0  125.0  150.0  175.0  200.0

In [35]:
df

          W         X         Y         Z
A  0.953890  0.237826  0.696741  0.087344
B -0.751095 -0.982188 -0.560045  0.701380
C -0.291148 -1.045924 -0.093133 -2.515986
D  1.402716 -1.069290  0.722661  0.548650
E  0.123803  0.011254  0.288670 -1.588083

          W         X         Y         Z
A  0.953890  0.237826  0.696741  0.087344
B -0.751095 -0.982188 -0.560045  0.701380
C -0.291148 -1.045924 -0.093133 -2.515986
D  1.402716 -1.069290  0.722661  0.548650
E  0.123803  0.011254  0.288670 -1.588083